src/Conversion_3_Plus/Catalogs/Конвертации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Конвертации</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередКонвертацией</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеКонвертации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОтложеннымЗаполнением</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Conversion_3_Plus/Catalogs/Конвертации/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем КонсольКодаПередКонвертацией;

&НаКлиенте
Перем КонсольКодаПередОтложеннымЗаполнением;

&НаКлиенте
Перем КонсольКодаПослеКонвертации;

&НаКлиенте
Перем СветлаяТема;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПередКонвертацией, Элементы.ПередКонвертацией, ЭтотОбъект);
	Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПередОтложеннымЗаполнением, Элементы.ПередОтложеннымЗаполнением, ЭтотОбъект);
	Расш1_КонсольКода.СоздатьКонсоль(Элементы.АлгоритмПослеКонвертации, Элементы.ПослеКонвертации, ЭтотОбъект);
	
	// Создаем реквизит для хранения описания метаданных.
	Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "ОписаниеМетаданныхJSON");
	
	// Заполним реквизит метаданными конфигурации.
	ЭтотОбъект["ОписаниеМетаданныхJSON"] = ПолучитьОписаниеМетаданныхJSON(Объект.Конфигурация);
	
	//VanessaEditorLoad();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	ЭтотОбъект[Элементы.АлгоритмПередКонвертацией.Имя + "HTML"] = АдресКонсолиКода;
	ЭтотОбъект[Элементы.АлгоритмПередОтложеннымЗаполнением.Имя + "HTML"] = АдресКонсолиКода;
	ЭтотОбъект[Элементы.АлгоритмПослеКонвертации.Имя + "HTML"] = АдресКонсолиКода;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	// Запишем новый текст в реквизиты.
	Объект.АлгоритмПередКонвертацией = КонсольКодаПередКонвертацией.getText();
	Объект.АлгоритмПередОтложеннымЗаполнением = КонсольКодаПередОтложеннымЗаполнением.getText();
	Объект.АлгоритмПослеКонвертации = КонсольКодаПослеКонвертации.getText();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АлгоритмПередКонвертациейHTMLСформирован(Элемент)
	
	КонсольКодаПередКонвертацией = Элемент.Документ.defaultView;
	//КонсольКодаПередКонвертацией.createVanessaEditor("", "bsl");
	Расш1_КонсольКода.ИнициализацияРедактора(КонсольКодаПередКонвертацией, Объект.АлгоритмПередКонвертацией);
	КонсольКодаПередКонвертацией.updateMetadata(ЭтотОбъект["ОписаниеМетаданныхJSON"]);
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПередОтложеннымЗаполнениемHTMLСформирован(Элемент)
	
	КонсольКодаПередОтложеннымЗаполнением = Элемент.Документ.defaultView;
	Расш1_КонсольКода.ИнициализацияРедактора(КонсольКодаПередОтложеннымЗаполнением, Объект.АлгоритмПередОтложеннымЗаполнением);
	КонсольКодаПередОтложеннымЗаполнением.updateMetadata(ЭтотОбъект["ОписаниеМетаданныхJSON"]);
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПослеКонвертацииHTMLСформирован(Элемент)
	
	КонсольКодаПослеКонвертации = Элемент.Документ.defaultView;
	Расш1_КонсольКода.ИнициализацияРедактора(КонсольКодаПослеКонвертации, Объект.АлгоритмПослеКонвертации);
	КонсольКодаПослеКонвертации.updateMetadata(ЭтотОбъект["ОписаниеМетаданныхJSON"]);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СменитьТемуАлгоритмПередКонвертациейHTML(Команда)
	
	СветлаяТема = Не СветлаяТема;
	Расш1_КонсольКода.УстановитьТемуКонсоли(ЭтотОбъект, Элементы.АлгоритмПередКонвертацией.Имя + "HTML", СветлаяТема);
	Если СветлаяТема Тогда
		Элементы["СменитьТемуАлгоритмПередКонвертациейHTML"].Заголовок = "Темная";
		Элементы["СменитьТемуАлгоритмПередКонвертациейHTML"].ЦветФона = WebЦвета.Черный;
		Элементы["СменитьТемуАлгоритмПередКонвертациейHTML"].ЦветТекста = WebЦвета.Белый;
	Иначе
		Элементы["СменитьТемуАлгоритмПередКонвертациейHTML"].Заголовок = "Светлая";
		Элементы["СменитьТемуАлгоритмПередКонвертациейHTML"].ЦветФона = Новый Цвет();
		Элементы["СменитьТемуАлгоритмПередКонвертациейHTML"].ЦветТекста = Новый Цвет();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВхожденияАлгоритмПередКонвертациейHTML()
	КонсольКодаПередКонвертацией.editor.trigger("", "editor.action.changeAll");
КонецПроцедуры

&НаКлиенте
Процедура СменитьТемуАлгоритмПередОтложеннымЗаполнениемHTML(Команда)
	
	СветлаяТема = Не СветлаяТема;
	Расш1_КонсольКода.УстановитьТемуКонсоли(ЭтотОбъект, Элементы.АлгоритмПередОтложеннымЗаполнением.Имя + "HTML", СветлаяТема);
	Если СветлаяТема Тогда
		Элементы["СменитьТемуАлгоритмПередОтложеннымЗаполнениемHTML"].Заголовок = "Темная";
		Элементы["СменитьТемуАлгоритмПередОтложеннымЗаполнениемHTML"].ЦветФона = WebЦвета.Черный;
		Элементы["СменитьТемуАлгоритмПередОтложеннымЗаполнениемHTML"].ЦветТекста = WebЦвета.Белый;
	Иначе
		Элементы["СменитьТемуАлгоритмПередОтложеннымЗаполнениемHTML"].Заголовок = "Светлая";
		Элементы["СменитьТемуАлгоритмПередОтложеннымЗаполнениемHTML"].ЦветФона = Новый Цвет();
		Элементы["СменитьТемуАлгоритмПередОтложеннымЗаполнениемHTML"].ЦветТекста = Новый Цвет();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВхожденияАлгоритмПередОтложеннымЗаполнениемHTML()
	КонсольКодаПередОтложеннымЗаполнением.editor.trigger("", "editor.action.changeAll");
КонецПроцедуры

&НаКлиенте
Процедура СменитьТемуАлгоритмПослеКонвертацииHTML(Команда)
	
	СветлаяТема = Не СветлаяТема;
	Расш1_КонсольКода.УстановитьТемуКонсоли(ЭтотОбъект, Элементы.АлгоритмПослеКонвертации.Имя + "HTML", СветлаяТема);
	Если СветлаяТема Тогда
		Элементы["СменитьТемуАлгоритмПослеКонвертацииHTML"].Заголовок = "Темная";
		Элементы["СменитьТемуАлгоритмПослеКонвертацииHTML"].ЦветФона = WebЦвета.Черный;
		Элементы["СменитьТемуАлгоритмПослеКонвертацииHTML"].ЦветТекста = WebЦвета.Белый;
	Иначе
		Элементы["СменитьТемуАлгоритмПослеКонвертацииHTML"].Заголовок = "Светлая";
		Элементы["СменитьТемуАлгоритмПослеКонвертацииHTML"].ЦветФона = Новый Цвет();
		Элементы["СменитьТемуАлгоритмПослеКонвертацииHTML"].ЦветТекста = Новый Цвет();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВхожденияАлгоритмПослеКонвертацииHTML()
	КонсольКодаПослеКонвертации.editor.trigger("", "editor.action.changeAll");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьОписаниеМетаданныхJSON(Конфигурация)
	Возврат ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Конфигурация);
КонецФункции

#КонецОбласти

#Если Клиент Тогда
	СветлаяТема = Истина;
#КонецЕсли
